trivia-backend/artillery.yml
# Run with:
# artillery run -t https://api-test.reinvent-trivia.com artillery.yml

config:
  http:
    pool: 250
  phases:
    - duration: 600
      arrivalRate: 10
      name: "Minimal load"
    - duration: 1200
      arrivalRate: 10
      rampTo: 1000
      name: "Ramp up load"
    - duration: 1800
       # This seems to be the max RPS for single core.
       # Run multiple instances of artillery to utilize multiple cores.
      arrivalRate: 1000
      name: "High load"
scenarios:
  - name: "Documentation"
    weight: 1
    flow:
    - get:
        url: "/api/docs/"
  - name: "Get all questions"
    weight: 5
    flow:
    - get:
        url: "/api/trivia/all"
  - name: "Get single question"
    weight: 2
    flow:
    - get:
        url: "/api/trivia/question/1"
  - name: "Answer single question"
    weight: 2
    flow:
    - post:
        url: "/api/trivia/question/1"
        json:
          answer: "Broomball"